Back-End/ci4rplv2/app/Controllers/KumpulBerkas.php

SELECT *
FROM `list_lomba`
WHERE `id_tim` = '141'
AND `id_lomba` = '10'
 LIMIT 1
---
    public function pengisihan($id_tim,$id_lomba)
    {
        $model= new Mlistlomba();

        $datalistlomba  = $model
            ->where('id_tim',$id_tim)
            ->where('id_lomba',$id_lomba)
            ->first();