Back-End/ci4rplv2/app/Controllers/Login.php

SELECT *
FROM `user`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function auth(){
        $session = session();//Buat obj session
        $model = new Muser();// Ambil database tabel di 'Muser' sebagai variabel 'model'

        // Mengambil data input form
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        //'first()' Ambil 1 baris data(row) berdasarkan ketentuan [where('element_table',$variable_dicari)]
        $data = $model->where('username', $username)->first();