Back-End/ci4rplv2/app/Models/Mtim.php

SELECT *
FROM `tim`
WHERE `id_tim` = '140'
 LIMIT 1
---
    function getDetailTim($id_tim){
        $model = new Mtim();
        $data = $model->where('id_tim',$id_tim)->first();